package uz.neft.service.document.fastexcel;

public interface ExcelTemplate {
    String[] titles = {
            "СП, БТ",
            "№№ п.п.",
            "№№ скв.",
            "Абсолютная температура \nгаза перед штуцером (на устье), \nТу, K",
            "Давление перед \nштуцером (на устье), \nРу, МРа",
            "Плотность газа \nпри стандартных условиях, \nρгаза, kg/m3",
            "Плотность воздуха \nпри стандартных условиях, \nρвозд, kg/m3",
            "Коэффициент \nсверхсжимаемости газа, \nz ",
            "Псевдокритическая \nтемпература, \nТПКР, K",
            "Псевдокритическое \nдавление \nРПКР, МРа",
            "Приведенная \nтемпература, \nТПр, K",
            "Приведенное \nдавление \nРПР, МРа",
            "Шайбный \nкоэффициент расхода, \nС",
            "Относительная \nплотность газа, \nρ отн",
            "Поправочный коэффициент, \nзависящий от приведенных \nдавления и температуры, \nδ",
            "Средний расчетный \nдебит скважин, \nDСКВ, 1·10³ m³",
            "Поправочный \nкоэффициент \nК",
            "Дебит скважин, \nQскв, 1·10³ m³"
    };


//     ws.value(0,0,"СП, БТ");
//            ws.value(0,1,"№№ п.п.");
//            ws.value(0,2,"№№ скв.");
//            ws.value(0,3,"Абсолютная температура \nгаза перед штуцером (на устье), \nТу, K");
//            ws.value(0,4,"Давление перед \nштуцером (на устье), \nРу, МРа");
//            ws.value(0,5,"Плотность газа \nпри стандартных условиях, \nρгаза, kg/m3");
//            ws.value(0,6,"Плотность воздуха \nпри стандартных условиях, \nρвозд, kg/m3");
//            ws.value(0,7,"Коэффициент \nсверхсжимаемости газа, \nz ");
//            ws.value(0,8,"Псевдокритическая \nтемпература, \nТПКР, K");
//            ws.value(0,9,"Псевдокритическое \nдавление \nРПКР, МРа");
//            ws.value(0,10,"Приведенная \nтемпература, \nТПр, K");
//            ws.value(0,11,"Приведенное \nдавление \nРПР, МРа");
//            ws.value(0,12,"Шайбный \nкоэффициент расхода, \nС");
//            ws.value(0,13,"Относительная \nплотность газа, \nρ отн");
//            ws.value(0,14,"Поправочный коэффициент, \nзависящий от приведенных \nдавления и температуры, \nδ");
//            ws.value(0,15,"Средний расчетный \nдебит скважин, \nDСКВ, 1·10³ m³");
//            ws.value(0,16,"Поправочный \nкоэффициент \nК");
//            ws.value(0,17,"Дебит скважин, \nQскв, 1·10³ m³");
//}
}