package uz.neft.service.document;

import org.springframework.stereotype.Service;

@Service
public class ReportTemplate {

//    public static RowExcel reportTest(){
//        CellExcel cell=new CellExcel();
//        cell.add("СП, БТ");
//        cell.add("№№ п.п.");
//        cell.add("№№ скв.");
//        cell.add("Абсолютная температура \nгаза перед штуцером (на устье), \nТу, K");
//        cell.add("Давление перед \nштуцером (на устье), \nРу, МРа");
//        cell.add("Плотность газа \nпри стандартных условиях, \nρгаза, kg/m3");
//        cell.add("Плотность воздуха \nпри стандартных условиях, \nρвозд, kg/m3");
//        cell.add("Коэффициент \nсверхсжимаемости газа, \nz ");
//        cell.add("Псевдокритическая \nтемпература, \nТПКР, K");
//        cell.add("Псевдокритическое \nдавление \nРПКР, МРа");
//        cell.add("Приведенная \nтемпература, \nТПр, K");
//        cell.add("Приведенное \nдавление \nРПР, МРа");
//        cell.add("Шайбный \nкоэффициент расхода, \nС");
//        cell.add("Относительная \nплотность газа, \nρ отн");
//        cell.add("Поправочный коэффициент, \nзависящий от приведенных \nдавления и температуры, \nδ");
//        cell.add("Средний расчетный \nдебит скважин, \nDСКВ, 1·10³ m³");
//        cell.add("Поправочный \nкоэффициент \nК");
//        cell.add("Дебит скважин, \nQскв, 1·10³ m³");
//
//        RowExcel row=new RowExcel();
//        row.add(cell);
//        return row;
//    }


//    public static RowExcel reportTest(){
//        CellExcel cell=new CellExcel();
//        cell.add("СП, БТ");
//        cell.add("№№ п.п.");
//        cell.add("№№ скв.");
//        cell.add("Абсолютная температура \nгаза перед штуцером (на устье), \nТу, K");
//        cell.add("Давление перед \nштуцером (на устье), \nРу, МРа");
//        cell.add("Плотность газа \nпри стандартных условиях, \nρгаза, kg/m3");
//        cell.add("Плотность воздуха \nпри стандартных условиях, \nρвозд, kg/m3");
//        cell.add("Коэффициент \nсверхсжимаемости газа, \nz ");
//        cell.add("Псевдокритическая \nтемпература, \nТПКР, K");
//        cell.add("Псевдокритическое \nдавление \nРПКР, МРа");
//        cell.add("Приведенная \nтемпература, \nТПр, K");
//        cell.add("Приведенное \nдавление \nРПР, МРа");
//        cell.add("Шайбный \nкоэффициент расхода, \nС");
//        cell.add("Относительная \nплотность газа, \nρ отн");
//        cell.add("Поправочный коэффициент, \nзависящий от приведенных \nдавления и температуры, \nδ");
//        cell.add("Средний расчетный \nдебит скважин, \nDСКВ, 1·10³ m³");
//        cell.add("Поправочный \nкоэффициент \nК");
//        cell.add("Дебит скважин, \nQскв, 1·10³ m³");
//
//        RowExcel row=new RowExcel();
//        row.add(cell);
//        return row;
//    }

}
